In [1]:
import pandas as pd

In [2]:
gbpusd = pd.read_csv('../Data/Forex/GBPUSD.csv')

In [3]:
gbpusd.head()

         Date      Open      High       Low     Close  Adj Close  Volume
0  2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617     0.0
1  2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594     0.0
2  2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512     0.0
3  2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490     0.0
4  2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293     0.0

In [4]:
gbpusd.shape

(4825, 7)

In [5]:
gbpusd.tail()

            Date      Open      High       Low     Close  Adj Close  Volume
4820  2023-06-26  1.273253  1.274827  1.268971  1.272961   1.272961     0.0
4821  2023-06-27  1.270923  1.275917  1.270487  1.271197   1.271197     0.0
4822  2023-06-28  1.274454  1.275136  1.260827  1.274470   1.274470     0.0
4823  2023-06-29  1.264127  1.266592  1.259256  1.264254   1.264254     0.0
4824  2023-06-30  1.261495  1.272621  1.260144  1.261464   1.261464     0.0

Dropping Volume

In [6]:
gbpusd = gbpusd[["Date","Open","High","Low","Close", "Adj Close"]]

In [7]:
gbpusd.head()

         Date      Open      High       Low     Close  Adj Close
0  2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617
1  2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594
2  2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512
3  2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490
4  2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293

Checking if there are missing values

In [8]:
nan_mask = pd.isna(gbpusd).any(axis=1)

nan_values_df = gbpusd[nan_mask]
nan_values_df.shape

(16, 6)

Filling missing values with interpolate technique

In [9]:
gbpusd= gbpusd.interpolate(option='time')

In [10]:
gbpusd.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4825 entries, 0 to 4824
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   Date       4825 non-null   object
 1   Open       4825 non-null   float64
 2   High       4825 non-null   float64
 3   Low        4825 non-null   float64
 4   Close      4825 non-null   float64
 5   Adj Close  4825 non-null   float64
dtypes: float64(5), object(1)
memory usage: 226.3+ KB

Set Date as index

In [11]:
gbpusd.Date = pd.to_datetime(gbpusd.Date)

In [12]:
gbpusd = gbpusd.set_index("Date")

In [13]:
gbpusd.index

DatetimeIndex(['2005-01-03', '2005-01-04', '2005-01-05', '2005-01-06',
               '2005-01-07', '2005-01-10', '2005-01-11', '2005-01-12',
               '2005-01-13', '2005-01-14',
               ...
               '2023-06-19', '2023-06-20', '2023-06-21', '2023-06-22',
               '2023-06-23', '2023-06-26', '2023-06-27', '2023-06-28',
               '2023-06-29', '2023-06-30'],
              dtype='datetime64[ns]', name='Date', length=4825, freq=None)

In [14]:
gbpusd.head()

                Open      High       Low     Close  Adj Close
Date
2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617
2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594
2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512
2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490
2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293

In [15]:
gbpusd.tail()

                Open      High       Low     Close  Adj Close
Date
2023-06-26  1.273253  1.274827  1.268971  1.272961   1.272961
2023-06-27  1.270923  1.275917  1.270487  1.271197   1.271197
2023-06-28  1.274454  1.275136  1.260827  1.274470   1.274470
2023-06-29  1.264127  1.266592  1.259256  1.264254   1.264254
2023-06-30  1.261495  1.272621  1.260144  1.261464   1.261464

Checking if there are missing dates

In [16]:
missing_dates  = pd.date_range(
  start="2005-02-22", end="2023-06-30").difference(gbpusd.index)

In [17]:
missing_dates

DatetimeIndex(['2005-02-26', '2005-02-27', '2005-03-05', '2005-03-06',
               '2005-03-12', '2005-03-13', '2005-03-19', '2005-03-20',
               '2005-03-26', '2005-03-27',
               ...
               '2023-05-27', '2023-05-28', '2023-06-03', '2023-06-04',
               '2023-06-10', '2023-06-11', '2023-06-17', '2023-06-18',
               '2023-06-24', '2023-06-25'],
              dtype='datetime64[ns]', length=1914, freq=None)

Filling the missing dates

In [18]:
complete_date_range =  pd.date_range(start='2005-01-03', end='2023-06-30', freq='D')

In [19]:
complete_forex_data = pd.DataFrame(index=complete_date_range)

In [20]:
complete_forex_data = complete_forex_data.merge(gbpusd, left_index=True, right_index=True, how='left')

In [21]:
complete_forex_data.head(10)

                Open      High       Low     Close  Adj Close
2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617
2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594
2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512
2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490
2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293
2005-01-08       NaN       NaN       NaN       NaN        NaN
2005-01-09       NaN       NaN       NaN       NaN        NaN
2005-01-10  1.871888  1.879311  1.871398  1.876912   1.876912
2005-01-11  1.877405  1.882317  1.875785  1.878605   1.878605
2005-01-12  1.878111  1.893903  1.870487  1.890716   1.890716

In [22]:
# Reset the index and rename the 'forex_rate' column if needed
complete_forex_data.reset_index(inplace=True)
complete_forex_data.rename(columns={'index': 'Date'}, inplace=True)

In [23]:
complete_forex_data.head()

        Date      Open      High       Low     Close  Adj Close
0 2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617
1 2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594
2 2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512
3 2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490
4 2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293

In [24]:
complete_forex_data.set_index('Date', inplace=True)

In [25]:
complete_forex_data.index

DatetimeIndex(['2005-01-03', '2005-01-04', '2005-01-05', '2005-01-06',
               '2005-01-07', '2005-01-08', '2005-01-09', '2005-01-10',
               '2005-01-11', '2005-01-12',
               ...
               '2023-06-21', '2023-06-22', '2023-06-23', '2023-06-24',
               '2023-06-25', '2023-06-26', '2023-06-27', '2023-06-28',
               '2023-06-29', '2023-06-30'],
              dtype='datetime64[ns]', name='Date', length=6753, freq=None)

The new dates have no values. Saturdays and Holidays take the value of the previos date (backward filling). Sundays take the values of the next date (forward filling).

In [26]:

# Forward fill (ffill) for Saturdays
complete_forex_data = complete_forex_data.fillna(method='ffill', limit=1)

# Backward fill (bfill) for Sundays
complete_forex_data = complete_forex_data.fillna(method='bfill', limit=1)

In [27]:
complete_forex_data.head(10)

                Open      High       Low     Close  Adj Close
Date
2005-01-03  1.919791  1.919791  1.900490  1.904617   1.904617
2005-01-04  1.904617  1.908506  1.878816  1.883594   1.883594
2005-01-05  1.883594  1.889216  1.873712  1.885512   1.885512
2005-01-06  1.885690  1.885690  1.870802  1.876490   1.876490
2005-01-07  1.876595  1.886010  1.865811  1.871293   1.871293
2005-01-08  1.876595  1.886010  1.865811  1.871293   1.871293
2005-01-09  1.871888  1.879311  1.871398  1.876912   1.876912
2005-01-10  1.871888  1.879311  1.871398  1.876912   1.876912
2005-01-11  1.877405  1.882317  1.875785  1.878605   1.878605
2005-01-12  1.878111  1.893903  1.870487  1.890716   1.890716

Checking for missing values

In [28]:
nan_mask = pd.isna(complete_forex_data).any(axis=1)

nan_values_df = complete_forex_data[nan_mask]
nan_values_df.shape

(0, 5)

In [29]:
complete_forex_data.to_csv("prepared_Forex_GBPUSD.csv", index="None")